# ANALYSE LA DATA

In [1]:
import pandas as pd
df=pd.read_csv("data.csv")

In [2]:
df.head()

,id,date,first_name,last_name,email,gender,ip_address,country,price_paid,tax
0,1,03/28/2021,Marylin,Alders,malders0@shop-pro.jp,Male,160.119.8.119,Canada,$5.36,NaN
1,2,03/19/2021,Hinda,Harridge,hharridge1@gnu.org,Female,210.51.172.132,Canada,$8.32,NaN
2,3,03/17/2021,Erl,Kilminster,ekilminster2@etsy.com,Male,213.8.101.145,United States,$3.73,20.0
3,4,03/19/2021,Grata,Brantl,gbrantl3@umn.edu,Female,5.140.237.101,United States,$3.70,20.0
4,5,03/24/2021,Kanya,Beasant,kbeasant4@jigsy.com,Male,106.252.162.233,Morocco,$9.24,20.0

In [6]:
df["price_paid"].describe()

count      1000
unique      528
top       $3.73
freq          8
Name: price_paid, dtype: object

In [7]:
df.price_paid=df.price_paid.apply(lambda x: x.replace("$",""))
df.price_paid=df.price_paid.astype(float)

In [10]:
df["price_paid"].dtype

dtype('float64')

In [11]:
df.price_paid.mean()

6.461930000000001

In [12]:
df.price_paid.sum()

6461.93

In [13]:
df.price_paid.min()

3.0

In [14]:
df.price_paid.max()

10.0

In [15]:
df.country.unique()

array(['Canada', 'United States', 'Morocco', 'France', nan], dtype=object)

In [16]:
df["country"].value_counts()

France           408
United States    333
Canada           161
Morocco           54
Name: country, dtype: int64

In [18]:
df.gender.value_counts(normalize=True)

Female    0.529538
Male      0.470462
Name: gender, dtype: float64

In [21]:
df.groupby("country").mean()

C:\Users\HP\AppData\Local\Temp\ipykernel_6608\2783625821.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby("country").mean()

                       id  price_paid   tax
country
Canada         437.049689    6.319565  20.0
France         525.588235    6.420613  20.0
Morocco        492.425926    6.721667  20.0
United States  504.954955    6.557568  20.0

In [23]:
df.groupby("gender")["price_paid"].sum()

gender
Female    3165.26
Male      2833.61
Name: price_paid, dtype: float64

In [24]:
df.groupby(["gender","country"]).mean()

C:\Users\HP\AppData\Local\Temp\ipykernel_6608\1075162087.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby(["gender","country"]).mean()

                              id  price_paid   tax
gender country
Female Canada         461.472973    6.419324  20.0
       France         512.648241    6.350352  20.0
       Morocco        479.925926    7.024815  20.0
       United States  487.282353    6.437118  20.0
Male   Canada         406.000000    6.117467  20.0
       France         534.928177    6.498950  20.0
       Morocco        483.652174    6.146957  20.0
       United States  525.284722    6.672500  20.0